* :boy:个人
  :PROPERTIES:
  :CATEGORY: Personal
  :END:
** 任务
*** DONE 测试任务的标签                                            :COMPUTER:
    CLOSED: [2017-05-08 周一 10:20] SCHEDULED: <2017-05-04 周四>
    - State "DONE"       from "TODO"       [2017-05-08 周一 10:20]
*** DONE [#B] 大队书记的手机掉水里了，需要把之前的照片重新发给小姨
    CLOSED: [2017-05-08 周一 10:20]

    - State "DONE"       from "TODO"       [2017-05-08 周一 10:20]
*** DONE [#B] 给妈妈购买手机
    CLOSED: [2017-05-10 周三 10:04]
    - State "DONE"       from "NEXT"       [2017-05-10 周三 10:04]
    1. [[https://www.vmall.com/product/641202729.html#755939196][荣耀畅玩 5A 双卡双待 移动版 智能手机（白色）]]
    2. [[http://item.mi.com/product/10000031.html][红米 4X]]
    3. [[https://detail.meizu.com/item/meilan5.html?skuid=3737&rc=gw][魅蓝 5]]

*** DONE [#B] 关于开展工商业行为准则学习与承诺书签订事宜的通知
    CLOSED: [2017-05-08 周一 10:21] DEADLINE: <2017-05-08 周一>

    - State "DONE"       from "TODO"       [2017-05-08 周一 10:21]
*** NEXT [#B] 将 Todoist 的任务迁移到 org mode 当中
    :LOGBOOK:
    CLOCK: [2017-05-16 周二 08:27]--[2017-05-16 周二 08:52] =>  0:25
    CLOCK: [2017-05-15 周一 20:44]--[2017-05-15 周一 20:55] =>  0:11
    CLOCK: [2017-05-15 周一 19:50]--[2017-05-15 周一 20:39] =>  0:49
    CLOCK: [2017-05-15 周一 19:29]--[2017-05-15 周一 19:35] =>  0:06
    :END:

*** DONE [#B] 将昨晚吃饭的钱还给李豪，总共 15 元
    CLOSED: [2017-05-18 周四 14:00]

    - State "DONE"       from "NEXT"       [2017-05-18 周四 14:00]
  [2017-05-18 周四 13:52]

*** DONE [#B] 将 2017.5 月的房租给房东，总计 924 元
    CLOSED: [2017-05-18 周四 14:00]

    - State "DONE"       from "NEXT"       [2017-05-18 周四 14:00]
  [2017-05-18 周四 13:53]


** 健康瘦身                                                        :PROJECT:
*** aa
** 维护博客                                                        :PROJECT:
** 回家过年                                                        :PROJECT:
** 维护 Emacs                                                      :PROJECT:
*** 使用 org-mode 实现 gtd                                          :PROJECT:
**** DONE 支持番茄工作法，使用 org-pomodoro 实现
     CLOSED: [2017-05-10 周三 23:48]
      - State "DONE"       from "TODO"       [2017-05-10 周三 23:48]
      1. [[http://guleilab.com/2016/05/05/OrgPomodoroNotifier/][给 org-pomodoro 增加桌面通知功能]]
      2. [[https://emacs-china.org/t/org-agenda/232][有没有 org-agenda 任务提醒的插件]]
**** DONE [#B] 测试 org pomodoro
     CLOSED: [2017-05-10 周三 23:53]
     - State "DONE"       from "NEXT"       [2017-05-10 周三 23:53]
     :LOGBOOK:
     CLOCK: [2017-04-12 周三 19:47]--[2017-04-13 周四 21:54] => 26:07
     :END:

**** TODO [#B] 给 emacs 增加提醒功能，可以不需要任务，直接设置提醒功能。

**** TODO [#B] Emacs 中添加自动提醒功能，可以方便设置各种提醒（如起床、锻炼等）

**** DONE 测试任务的标签
     CLOSED: [2017-05-08 周一 12:33]
     - State "DONE"       from "DEFERRED"   [2017-05-08 周一 12:33]
     - State "DEFERRED"   from "DONE"       [2017-05-08 周一 12:32] \\
       ==> DEFERRED ==> DONE
     - State "DONE"       from "NEXT"       [2017-05-08 周一 12:31]
     - State "NEXT"       from "WAITING"    [2017-05-08 周一 12:31]
     - State "WAITING"    from "TODO"       [2017-05-08 周一 12:31] \\
       s
     - State "TODO"       from "CANCELLED"  [2017-05-08 周一 12:30]
     - State "CANCELLED"  from "DEFERRED"   [2017-05-08 周一 12:30] \\
       测试将任务修改为 CANCELLED 时会添加标签
     - State "DEFERRED"   from "DONE"       [2017-05-08 周一 12:29] \\
       测试将任务修改为 DEFERRED 时会添加标签
     - State "DONE"       from "WAITING"    [2017-05-08 周一 12:28]
     - State "WAITING"    from              [2017-05-08 周一 12:27] \\
       测试将任务修改为 WAITING 时会添加标签
     - State "SOMEDAY"    from "WAITING"    [2017-05-08 周一 08:41]
     - State "WAITING"    from              [2017-05-08 周一 08:41] \\
       dfsadfkksdfkjs
***** 测试结果
      经过测试，发现任务状态变化时标签的添加和删除都是正确的。

**** DONE [#B] 将捕获的 TODO 事项放在 index.org/Index 标题下 [100%]
     CLOSED: [2017-05-11 周四 00:22]
     - State "DONE"       from "NEXT"       [2017-05-11 周四 00:22]
     :LOGBOOK:
     CLOCK: [2017-05-11 周四 00:16]--[2017-05-11 周四 00:22] =>  0:06
     CLOCK: [2017-05-11 周四 00:09]--[2017-05-11 周四 00:12] =>  0:03
     :END:
     [-] 测试使用 org-capture 抓取 TODO 事项，查看 TODO 事项是否在 index.org/Index 标题下

***** DONE [#B] 测试捕获的 TODO 事项是否会放在 index.org/Index 标题下
      CLOSED: [2017-05-11 周四 00:22]

      - State "DONE"       from "TODO"       [2017-05-11 周四 00:22]
**** DONE [#B] 测试捕获 Todo 事项到 index.org 文档中
     CLOSED: [2017-05-10 周三 23:08]

     - State "DONE"       from "TODO"       [2017-05-10 周三 23:08]
*** TODO [#B] 使用 emacs 编辑和发布博客
    可以参考子龙山人的配置，使用 org-octopress
    1. [[https://zilongshanren.com/blog/2015-07-19-add-org-mode-support.html?utm_source=tuicool][使用 Org-mode 来写博客]]
    2. [[https://zilongshanren.com/blog/2015-08-02-migrate-blog-to-hexo.html][迁移博客到 Hexo]]
    3. [[https://emacs-china.org/t/org-mode/1046][用 org-mode 写博客都有哪些比较方便的方案呢?]]
    或者可以在网上找找是否存在有直接支持 hexo 博客的 package.
*** TODO [#B] 支持编辑 evernote 笔记
*** TODO [#B] 支持在 emacs 中分析日志定位问题
*** TODO [#B] 将 esxi-sense 使用 elisp 实现并提供 package，然后集成到 spacemacs 中去。
*** TODO [#B] 支持 git
*** TODO [#B] 支持 svn
*** TODO [#B] 支持 c/c++ 编程
*** TODO [#B] 支持 markdown 编辑
*** DONE [#B] 升级到 emacs 25.2 版本
    CLOSED: [2017-05-10 周三 23:08]

    - State "DONE"       from "TODO"       [2017-05-10 周三 23:08]
*** TODO [#B] 配置 myorg 的 webdav，并和 MobileOrg 同步

*** TODO [#B] 系统学习 org mode，尤其是其中时间管理部分

*** DONE [#B] 让 spacemacs 支持 emoji 表情
    CLOSED: [2017-05-16 周二 08:04]
    - State "DONE"       from "NEXT"       [2017-05-16 周二 08:04]
    - State "NEXT"       from "DONE"       [2017-05-16 周二 07:48]
    :LOGBOOK:
    :END:

    - State "DONE"       from "TODO"       [2017-05-10 周三 23:52]
*** TODO [#B] 让 org mode 支持加密功能

*** NEXT [#B] 将自动切换主题的功能整理成 package，并集成到 spacemacs 中
    :LOGBOOK:
    CLOCK: [2017-05-15 周一 16:00]--[2017-05-15 周一 16:01] =>  0:01
    :END:

*** TODO [#B] 让 spacemacs 支持中英文混排

*** NEXT [#B] 支持 plantuml 绘制 uml [%]
    :LOGBOOK:
    CLOCK: [2017-05-11 周四 01:57]
    CLOCK: [2017-05-11 周四 01:27]--[2017-05-11 周四 01:52] =>  0:25
    CLOCK: [2017-05-11 周四 00:50]--[2017-05-11 周四 01:15] =>  0:25
    CLOCK: [2017-05-11 周四 00:42]--[2017-05-11 周四 00:48] =>  0:06
    CLOCK: [2017-05-10 周三 23:09]--[2017-05-10 周三 23:34] =>  0:25
    :END:
    [] 测试 plantuml 绘制 uml
** 科学上网                                                        :PROJECT:
*** TODO [#B] 购买域外虚拟主机
    [2017-05-09 周二 09:03]
**** Note ID: C5D146FA-A520-41A2-869E-EE4E3199937E
*** TODO [#B] 搭建影梭服务器进行科学上网
  [2017-05-09 周二 09:06]
**** Note ID: F4756E44-3989-4DED-81AC-62C9E589165A
*** TODO [#B] 购买域名
  [2017-05-09 周二 09:06]
**** Note ID: 513D4300-5AD9-4995-A62B-E2C00F165498
*** TODO [#B] 将域名进行备案
  [2017-05-09 周二 09:06]
**** Note ID: 7BA2D67A-083D-4380-A8E8-01DD0F39D2BC
*** TODO [#B] 将博客迁移到新主机上
  [2017-05-09 周二 09:07]
**** Note ID: FF4D1BAD-E006-4B97-8E88-CA489E6AD312
* :computer:工作
  :PROPERTIES:
  :CATEGORY: Work
  :END:
** 任务
*** DONE [#B] 下班后帮助王燕写校验数据一致性的脚本
    CLOSED: [2017-05-09 周二 19:21]
    - State "DONE"       from "NEXT"       [2017-05-09 周二 19:21]
    :LOGBOOK:
    CLOCK: [2017-05-09 周二 18:46]--[2017-05-09 周二 19:11] =>  0:25
    :END:

*** DONE [#B] 松耦合一期项目总结                            :OFFICE:COMPUTER:
    CLOSED: [2017-05-10 周三 11:39] DEADLINE: <2017-05-11 周四 23:00>
    - State "DONE"       from "NEXT"       [2017-05-10 周三 11:39]
    :LOGBOOK:
    CLOCK: [2017-05-10 周三 11:18]--[2017-05-10 周三 11:39] =>  0:21
    CLOCK: [2017-05-10 周三 10:47]--[2017-05-10 周三 11:12] =>  0:25
    :END:

*** DONE [#B] 定位和解决使用分区 u 盘在线升级到 V1.2.27 时出现在线升级失败的问题 [100%]:OFFICE:COMPUTER:
    CLOSED: [2017-05-18 周四 14:22]
    - State "DONE"       from "NEXT"       [2017-05-18 周四 14:22]
    - State "NEXT"       from "WAITING"    [2017-05-18 周四 14:08]
    - State "WAITING"    from "NEXT"       [2017-05-16 周二 08:07] \\
      等待王婵娟发邮件，确认什么时候合入到 V1.2.27TPXX 分支当中
    :LOGBOOK:
    CLOCK: [2017-05-13 周六 16:33]--[2017-05-13 周六 17:54] =>  1:21
    CLOCK: [2017-05-13 周六 15:39]--[2017-05-13 周六 16:27] =>  0:48 磁盘出现故障重启设备导致该时间段很长
    CLOCK: [2017-05-13 周六 15:08]--[2017-05-13 周六 15:33] =>  0:25
    CLOCK: [2017-05-11 周四 16:20]--[2017-05-11 周四 16:45] =>  0:25
    CLOCK: [2017-05-11 周四 11:31]--[2017-05-11 周四 13:55] =>  2:24
    CLOCK: [2017-05-11 周四 10:56]--[2017-05-11 周四 11:21] =>  0:25
    CLOCK: [2017-05-11 周四 10:15]--[2017-05-11 周四 10:40] =>  0:25
    :END:
    - [X] 制作 V1.2.27_T01.rtpg 的升级 u 盘
    - [X] 将双控 253.53/54 升级到 V1.2.21T01 版本
        - [X] 制作 V1.2.21T01 的全盘升级 u 盘
        - [X] 使用全盘升级设备
        - [X] 回退设备的 BMC 等驱动的小版本
    - [X] 补充 ut 测试用例
    - [X] 在 V1.2.18T01 和 V1.2.21T01 版本上重新编译 dup_shell_bin 脚本
    - [X] 使用编译好的 dup_shell_bin 来构造同步 rtpg 参数的脚本
    - [X] 编写升级指导，并按升级指导进行升级测试
    - [X] 提交修改代码到维护线，解决问题，并将问题单走给李豪审核
    - [X] 将问题单走给 CMO 归档
    - [X] 等待王婵娟的邮件确定什么时候将代码合入到 V1.2.27TPXX 分支当中
    - [X] V1.2.27T02 验证版本已编译好，请取用验证。
    - [X] 将借测试的 V1.2.27T02 升级 u 盘还回去
**** DONE [#B] 分解待办的事情，并合理的安排做事情的顺序
     CLOSED: [2017-05-13 周六 15:06]
     - State "DONE"       from "NEXT"       [2017-05-13 周六 15:06]
     :LOGBOOK:
     CLOCK: [2017-05-13 周六 14:49]--[2017-05-13 周六 15:06] =>  0:17
     :END:
     测试在线 usb 升级任务安排
**** NEXT [#B] 归还从测试那里借的备用优盘
*** DONE [#B] 归还周末加班借的钥匙                                   :OFFICE:
    CLOSED: [2017-05-15 周一 11:16]
    - State "DONE"       from "NEXT"       [2017-05-15 周一 11:16]
*** NEXT [#B] 北部湾银行更换备件并进行升级，需要跟踪整个升级过程，保证升级成功 :OFFICE:COMPUTER:
*** TODO [#B] 请同事吃饭
    [2017-05-09 周二 09:04]
**** Note ID: 0FF258E7-1D68-4052-8F91-0034BB789F1D
** ubs                                                             :PROJECT:
*** 解决问题                                                        :PROJECT:
**** NEXT [#B] 定位测试昨天出现的克隆虚拟机失败的原因       :OFFICE:COMPUTER:
     :LOGBOOK:
     CLOCK: [2017-05-11 周四 14:26]--[2017-05-11 周四 14:51] =>  0:25
     CLOCK: [2017-05-11 周四 13:55]--[2017-05-11 周四 14:20] =>  0:25
     :END:

*** 解决脑裂时路径切换问题                                          :PROJECT:
**** NEXT [#B] 编写脑裂时路径切换的方案-standby 循环上报 tpg
     :LOGBOOK:
     CLOCK: [2017-05-08 周一 18:20]--[2017-05-08 周一 18:45] =>  0:25
     CLOCK: [2017-05-08 周一 16:04]--[2017-05-08 周一 16:27] =>  0:23
     CLOCK: [2017-05-08 周一 15:34]--[2017-05-08 周一 15:59] =>  0:25
     CLOCK: [2017-05-08 周一 15:02]--[2017-05-08 周一 15:27] =>  0:25
     CLOCK: [2017-05-08 周一 14:31]--[2017-05-08 周一 14:56] =>  0:25
     :END:

**** DONE [#B] 修改 rtpg 命令影响，当 rtpg 的缓冲区小于实际上报的数据时不会选取下一个 tpg
     CLOSED: [2017-05-09 周二 16:05]
     - State "DONE"       from "NEXT"       [2017-05-09 周二 16:05]
       经过验证，功能符合预期，当 rtpg 的缓冲区小于实际上报的数据时不会下一个 tpg
     :LOGBOOK:
     CLOCK: [2017-05-09 周二 15:31]--[2017-05-09 周二 15:56] =>  0:25
     CLOCK: [2017-05-09 周二 14:55]--[2017-05-09 周二 15:20] =>  0:25
     CLOCK: [2017-05-08 周一 18:07]--[2017-05-08 周一 18:18] =>  0:11 替换 ko 重启设备，待会再继续测试
     :END:
**** NEXT 编写脑裂时路径切换的测试用例
     :LOGBOOK:
     CLOCK: [2017-05-15 周一 16:01]--[2017-05-15 周一 16:28] =>  0:27
     :END:
**** NEXT 测试脑裂时路径切换
     :LOGBOOK:
     CLOCK: [2017-05-10 周三 10:05]--[2017-05-10 周三 10:30] =>  0:25
     CLOCK: [2017-05-09 周二 20:52]--[2017-05-09 周二 21:11] =>  0:19
     CLOCK: [2017-05-09 周二 20:15]--[2017-05-09 周二 20:40] =>  0:25
     CLOCK: [2017-05-09 周二 18:00]--[2017-05-09 周二 18:25] =>  0:25
     CLOCK: [2017-05-09 周二 17:12]--[2017-05-09 周二 17:37] =>  0:25
     CLOCK: [2017-05-09 周二 16:40]--[2017-05-09 周二 17:05] =>  0:25
     :END:
**** TODO [#B] 验证测试的 win2008 服务器的蓝屏捕获功能，主动构造蓝屏看看能够将蓝屏文件给捕获出来
**** NEXT 测试多个主机下在 standby 状态下下发 rtpg 命令时，其循环上报 tpg 是否正常
**** NEXT [#B] 定位和解决在测试脑裂路径切换时重启 253.77 端后 alua 路径状态不正确的问题 :OFFICE:COMPUTER:
     :PROPERTIES:
     :ID:       f421774b-536b-45eb-a2c2-47b8b05553d3
     :Attachments:
     :END:
     - State "NEXT"       from "WAITING"    [2017-05-11 周四 11:40]
       贺洪元加了部分调试信息，需要继续复现
     - State "WAITING"    from "NEXT"       [2017-05-11 周四 10:06] \\
       将设备 msg 发给贺洪元，让其继续定位问题原因
*** TODO [#B] 双端重启主节点，必现部分双活 LUN 的从节点的路径丢失，导致拷贝数据脚本出错

*** NEXT [#B] 定位测试出现的同步配置时出现创建 alua 目录失败的问题
**** DONE 编写 ko 测试 lookup_create 函数在什么情况下会报错
     CLOSED: [2017-05-09 周二 15:21]
     - State "DONE"       from "NEXT"       [2017-05-09 周二 15:21]
     - State "NEXT"       from "WAITING"    [2017-05-09 周二 15:20]
     - State "WAITING"    from "NEXT"       [2017-05-09 周二 14:50] \\
       定位可能是代理通道发了两个创建 tg_pt_gp 目录的事件导致的，现在让李江定位是否是该原因。
     :LOGBOOK:
     CLOCK: [2017-05-09 周二 14:22]--[2017-05-09 周二 14:47] =>  0:25
     :END:
**** DONE 在报错的地方将返回的错误码打印出来，然后编个 ko 让测试复现，看看是什么原因导致的报错
     CLOSED: [2017-05-09 周二 15:59]
     - State "DONE"       from "WAITING"    [2017-05-09 周二 15:59]
     - State "WAITING"    from "DONE"       [2017-05-09 周二 13:53] \\
       加调试信息将创建目录失败的错误码打印出来，让测试复现后再进一步定位
     - State "DONE"       from "NEXT"       [2017-05-09 周二 12:10]
     :LOGBOOK:
     CLOCK: [2017-05-09 周二 11:32]--[2017-05-09 周二 11:57] =>  0:25
     :END:
**** DONE 整理当前定位的结论并输出文档
     CLOSED: [2017-05-09 周二 13:51]
     - State "DONE"       from "TODO"       [2017-05-09 周二 13:51]
**** TODO 修改代码并打桩验证功能是否修改完成
*** DONE [#B] 开会讨论松耦合路径卸载方案问题
    CLOSED: [2017-05-10 周三 15:45] DEADLINE: <2017-04-20 周四 14:30>

    - State "DONE"       from "TODO"       [2017-05-10 周三 15:45]
** 面试                                                            :PROJECT:
* :family:家庭
  :PROPERTIES:
  :CATEGORY: Family
  :END:
** 任务
* :school:学习
  :PROPERTIES:
  :CATEGORY: Learn
  :END:
** 任务
** 动态规划
** 存储基础知识
* :books:阅读
  :PROPERTIES:
  :CATEGORY: Read
  :END:
** 任务
** 编码：隐匿在计算机软硬件背后的语言
** 适合女人阅读的 10 本书
* org-mode configuration
#+STARTUP: overview
#+TAGS: { OFFICE(o) HOME(h) } COMPUTER(c) TELEPHONE(t) SHOPPING(s) OUTSIDE(o) LUNCH(l)
#+TAGS: PROJECT(p) CATEGORY(g)
